## dev plan
```
data.aws_availability_zones.available: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-1507316623]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=andrei-eks20240817223110137500000003-20240817223110681400000008]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-1020775929]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-996446441]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-3468349662]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=andrei-eks20240817223110137500000003-20240817223110587600000004]
module.eks.aws_iam_policy.cluster_deny_log_group[0]: Refreshing state... [id=arn:aws:iam::391856996559:policy/andrei-eks-deny-log-group20240817223110137200000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=andrei-eks20240817223110137500000003-20240817223110599500000006]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=391856996559]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0e763cac0cf7d6eab]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=andrei-eks20240817223110137500000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=andrei-eks20240817223110137500000003-20240817223110595300000005]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1048020371]
module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0]: Refreshing state... [id=andrei-eks20240817223110137500000003-20240817223110672500000007]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3632045839]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::391856996559:policy/andrei-eks-elb-sl-role-creation20240817223110137200000002]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=eu-north-1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01938c8033e75a9fa]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=391856996559]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::391856996559:user/kaushal2]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d3e5532904b1bd6e]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-0613c68fd190f75fb]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-09ab7f8fde2175753]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c5e0cea02f6d7bbd]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0dd4ecb1564644008]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0007f567d4817d999]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0862320f31f265b55]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-010d74926b498f993]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-068d418ec65c672ad]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0272f3dbc19ae6fd6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ad1b71a0b3e3c920]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-01271b5d86cec8b6c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ca875887b1f181b8]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-020408476ceb9cd8c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-092c00eb5388b2094]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01aaaedc186a1a6db]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cb9d7831618cf851]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ad1b71a0b3e3c9201080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ed07b6d00ad9f4c2]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-091dfe1d70a4a5cbe]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-079d7fa2dabe21c5f]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_caller_identity.current: Read complete after 0s [id=391856996559]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-090dcecdfb0e9db94]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08763e05611b0b658]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-012c9175d56b2f05c]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0194ad446c3fdcf4d]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ca875887b1f181b81080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # helm_release.localchart2 will be created
  + resource "helm_release" "localchart2" {
      + atomic                     = false
      + chart                      = "./charts/chart2"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "my-local-chart2"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "force_update"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "recreate_pods"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/andrei-eks/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/eks/andrei-eks/cluster"
        }
      + tags_all          = {
          + "Name" = "/aws/eks/andrei-eks/cluster"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "andrei-eks"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.30"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = false
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-068d418ec65c672ad",
              + "subnet-0862320f31f265b55",
              + "subnet-0dd4ecb1564644008",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "andrei-eks-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "andrei-eks-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_deny_log_group[0] will be destroyed
  # (because aws_iam_policy.cluster_deny_log_group is not in configuration)
  - resource "aws_iam_policy" "cluster_deny_log_group" {
      - arn              = "arn:aws:iam::391856996559:policy/andrei-eks-deny-log-group20240817223110137200000001" -> null
      - attachment_count = 0 -> null
      - description      = "Deny CreateLogGroup" -> null
      - id               = "arn:aws:iam::391856996559:policy/andrei-eks-deny-log-group20240817223110137200000001" -> null
      - name             = "andrei-eks-deny-log-group20240817223110137200000001" -> null
      - name_prefix      = "andrei-eks-deny-log-group" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Deny"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAVWPD7IDHWICAKVJIK" -> null
      - tags_all         = {} -> null
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be destroyed
  # (because aws_iam_policy.cluster_elb_sl_role_creation is not in configuration)
  - resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      - arn              = "arn:aws:iam::391856996559:policy/andrei-eks-elb-sl-role-creation20240817223110137200000002" -> null
      - attachment_count = 0 -> null
      - description      = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role" -> null
      - id               = "arn:aws:iam::391856996559:policy/andrei-eks-elb-sl-role-creation20240817223110137200000002" -> null
      - name             = "andrei-eks-elb-sl-role-creation20240817223110137200000002" -> null
      - name_prefix      = "andrei-eks-elb-sl-role-creation" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeAccountAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAVWPD7IDH44FE4EXHI" -> null
      - tags_all         = {} -> null
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "andrei-eks-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_role.cluster[0] will be destroyed
  # (because aws_iam_role.cluster is not in configuration)
  - resource "aws_iam_role" "cluster" {
      - arn                   = "arn:aws:iam::391856996559:role/andrei-eks20240817223110137500000003" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks.amazonaws.com"
                        }
                      - Sid       = "EKSClusterAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-08-17T22:31:10Z" -> null
      - force_detach_policies = true -> null
      - id                    = "andrei-eks20240817223110137500000003" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "andrei-eks20240817223110137500000003" -> null
      - name_prefix           = "andrei-eks" -> null
      - path                  = "/" -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAVWPD7IDH3TVI5AG45" -> null
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "andrei-eks-cluster-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "andrei-eks-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      - id         = "andrei-eks20240817223110137500000003-20240817223110587600000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "andrei-eks20240817223110137500000003" -> null
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      - id         = "andrei-eks20240817223110137500000003-20240817223110599500000006" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy" -> null
      - role       = "andrei-eks20240817223110137500000003" -> null
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      - id         = "andrei-eks20240817223110137500000003-20240817223110595300000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController" -> null
      - role       = "andrei-eks20240817223110137500000003" -> null
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_deny_log_group is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_deny_log_group" {
      - id         = "andrei-eks20240817223110137500000003-20240817223110672500000007" -> null
      - policy_arn = "arn:aws:iam::391856996559:policy/andrei-eks-deny-log-group20240817223110137200000001" -> null
      - role       = "andrei-eks20240817223110137500000003" -> null
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_elb_sl_role_creation is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      - id         = "andrei-eks20240817223110137500000003-20240817223110681400000008" -> null
      - policy_arn = "arn:aws:iam::391856996559:policy/andrei-eks-elb-sl-role-creation20240817223110137200000002" -> null
      - role       = "andrei-eks20240817223110137500000003" -> null
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:eu-north-1:391856996559:security-group/sg-09ab7f8fde2175753" -> (known after apply)
      ~ description            = "EKS cluster security group." -> "EKS cluster security group" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow cluster egress access to the Internet."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-09ab7f8fde2175753" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow pods to communicate with the EKS cluster API."
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0e763cac0cf7d6eab",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "andrei-eks2024081722312508550000000f" -> (known after apply)
      ~ name_prefix            = "andrei-eks" -> "andrei-eks-cluster-" # forces replacement
      ~ owner_id               = "391856996559" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "andrei-eks-eks_cluster_sg" -> "andrei-eks-cluster"
        }
      ~ tags_all               = {
          ~ "Name" = "andrei-eks-eks_cluster_sg" -> "andrei-eks-cluster"
        }
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "andrei-eks-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "andrei-eks-node"
          + "kubernetes.io/cluster/andrei-eks" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "andrei-eks-node"
          + "kubernetes.io/cluster/andrei-eks" = "owned"
        }
      + vpc_id                 = "vpc-01938c8033e75a9fa"
    }

  # module.eks.aws_security_group.workers[0] will be destroyed
  # (because aws_security_group.workers is not in configuration)
  - resource "aws_security_group" "workers" {
      - arn                    = "arn:aws:ec2:eu-north-1:391856996559:security-group/sg-0e763cac0cf7d6eab" -> null
      - description            = "Security group for all nodes in the cluster." -> null
      - egress                 = [] -> null
      - id                     = "sg-0e763cac0cf7d6eab" -> null
      - ingress                = [] -> null
      - name                   = "andrei-eks2024081722312474830000000e" -> null
      - name_prefix            = "andrei-eks" -> null
      - owner_id               = "391856996559" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"                             = "andrei-eks-eks_worker_sg"
          - "kubernetes.io/cluster/andrei-eks" = "owned"
        } -> null
      - tags_all               = {
          - "Name"                             = "andrei-eks-eks_worker_sg"
          - "kubernetes.io/cluster/andrei-eks" = "owned"
        } -> null
      - vpc_id                 = "vpc-01938c8033e75a9fa" -> null
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] will be destroyed
  # (because aws_security_group_rule.cluster_egress_internet is not in configuration)
  - resource "aws_security_group_rule" "cluster_egress_internet" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow cluster egress access to the Internet." -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-3632045839" -> null
      - protocol               = "-1" -> null
      - security_group_id      = "sg-09ab7f8fde2175753" -> null
      - security_group_rule_id = "sgr-0940d2c56721e6ee2" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be destroyed
  # (because aws_security_group_rule.cluster_https_worker_ingress is not in configuration)
  - resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      - description              = "Allow pods to communicate with the EKS cluster API." -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-1020775929" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-09ab7f8fde2175753" -> null
      - security_group_rule_id   = "sgr-0066ea0e6a991a8fe" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0e763cac0cf7d6eab" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] will be destroyed
  # (because aws_security_group_rule.workers_egress_internet is not in configuration)
  - resource "aws_security_group_rule" "workers_egress_internet" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow nodes all egress to the Internet." -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-3468349662" -> null
      - protocol               = "-1" -> null
      - security_group_id      = "sg-0e763cac0cf7d6eab" -> null
      - security_group_rule_id = "sgr-0b6388eef44428509" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be destroyed
  # (because aws_security_group_rule.workers_ingress_cluster is not in configuration)
  - resource "aws_security_group_rule" "workers_ingress_cluster" {
      - description              = "Allow workers pods to receive communication from the cluster control plane." -> null
      - from_port                = 1025 -> null
      - id                       = "sgrule-1048020371" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0e763cac0cf7d6eab" -> null
      - security_group_rule_id   = "sgr-005a013290e5cc44b" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-09ab7f8fde2175753" -> null
      - to_port                  = 65535 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be destroyed
  # (because aws_security_group_rule.workers_ingress_cluster_https is not in configuration)
  - resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      - description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane." -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-1507316623" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0e763cac0cf7d6eab" -> null
      - security_group_rule_id   = "sgr-0367fd713f778a4c9" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-09ab7f8fde2175753" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] will be destroyed
  # (because aws_security_group_rule.workers_ingress_self is not in configuration)
  - resource "aws_security_group_rule" "workers_ingress_self" {
      - description              = "Allow node to communicate with each other." -> null
      - from_port                = 0 -> null
      - id                       = "sgrule-996446441" -> null
      - protocol                 = "-1" -> null
      - security_group_id        = "sg-0e763cac0cf7d6eab" -> null
      - security_group_rule_id   = "sgr-00235a88aecc439de" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0e763cac0cf7d6eab" -> null
      - to_port                  = 65535 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "andrei-eks"
          + "cluster_service_cidr"               = (known after apply)
          + "cluster_version"                    = "1.30"
        }
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "andrei-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "eks_nodes-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-068d418ec65c672ad",
          + "subnet-0862320f31f265b55",
          + "subnet-0dd4ecb1564644008",
        ]
      + tags                   = {
          + "Name" = "eks_nodes"
        }
      + tags_all               = {
          + "Name" = "eks_nodes"
        }
      + version                = "1.30"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "eks_nodes-eks-node-group-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for eks_nodes EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks_nodes-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "eks_nodes"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "eks_nodes"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "eks_nodes"
            }
        }
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Default"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::391856996559:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::391856996559:user/kaushal2",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/andrei-eks"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "andrei-eks cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                           = {
          + "terraform-aws-modules" = "eks"
        }
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 32 to add, 0 to change, 16 to destroy.

Changes to Outputs:
  + cluster_endpoint          = (known after apply)
  + cluster_id                = (known after apply)
  ~ cluster_security_group_id = "sg-09ab7f8fde2175753" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```